src/v2ray/transport/websocket.org
#+TITLE: Websocket
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css" />
#+HTML_LINK_HOME: transport.html
#+HTML_LINK_UP: tls.html
#+OPTIONS: num:nil timestamp:nil ^:nil

WebSocket 的配置其实很简单，就跟 mKCP 一样把 network 一改就行了
* 配置
** 服务器
#+begin_src js 
  {
      "inbounds": [
	  {
	      "port": 16823,
	      "protocol": "vmess",
	      "settings": {
		  "clients": [
		      {
			  "id": "b831381d-6324-4d53-ad4f-8cda48b30811",
			  "alterId": 64
		      }
		  ]
	      },
	      "streamSettings": {
		  "network":"ws"
	      }
	  }
      ],
      "outbounds": [
	  {
	      "protocol": "freedom",
	      "settings": {}
	  }
      ]
  }
#+end_src
** 客户端
#+begin_src js 
  {
      "inbounds": [
	  {
	      "port": 1080,
	      "protocol": "socks",
	      "sniffing": {
		  "enabled": true,
		  "destOverride": ["http", "tls"]
	      },
	      "settings": {
		  "auth": "noauth"
	      }
	  }
      ],
      "outbounds": [
	  {
	      "protocol": "vmess",
	      "settings": {
		  "vnext": [
		      {
			  "address": "serveraddr.com",
			  "port": 16823,
			  "users": [
			      {
				  "id": "b831381d-6324-4d53-ad4f-8cda48b30811",
				  "alterId": 64
			      }
			  ]
		      }
		  ]
	      },
	      "streamSettings":{
		  "network":"ws"
	      }
	  }
      ]
  }
#+end_src
* WebSocket + TLS + Web
接下来搭配 Web 服务并同时实现 TLS 和 WebSocket
+ 使用 Nginx/Caddy/Apache 是因为 VPS 已经有 Nginx/Caddy/Apache 可以将 V2Ray 稍作隐藏
+ 使用 WebSocket 是因为搭配 Nginx/Caddy/Apache 只能用 WebSocket
+ 使用 TLS 是因为可以流量加密，看起来更像 HTTPS

#+begin_example
  也许 WebSocket + TLS + Web 的配置组合相对较好，但不意味着这样的配置适合任何人
#+end_example

注意: V2Ray 的 Websocket + TLS 配置组合并不依赖 Nginx/Caddy/Apache，只是能与其搭配使用而已，没有它们也可以正常使用
** 服务器
这次 TLS 的配置将写入 Web 配置中，由这些软件来监听 443 端口（443 比较常用，并非 443 不可），然后将流量转发到 V2Ray 的 WebSocket 所监听的内网端口（本例是 10000），V2Ray 服务器端不需要配置 TLS
*** V2ray
#+begin_src js 
  {
      "inbounds": [
	  {
	      "port": 10000,
	      "listen":"127.0.0.1",//只监听 127.0.0.1，避免除本机外的机器探测到开放了 10000 端口
	      "protocol": "vmess",
	      "settings": {
		  "clients": [
		      {
			  "id": "b831381d-6324-4d53-ad4f-8cda48b30811",
			  "alterId": 0
		      }
		  ]
	      },
	      "streamSettings": {
		  "network": "ws",
		  "wsSettings": {
		      "path": "/ray"
		  }
	      }
	  }
      ],
      "outbounds": [
	  {
	      "protocol": "freedom",
	      "settings": {}
	  }
      ]
  }
#+end_src
*** 证书
Nginx 配置和 Apache 配置中使用的是域名和证书使用 TLS 小节的举例，请替换成自己的
#+begin_example
因为 Caddy 会自动申请证书并自动更新，所以使用 Caddy 不用指定证书、密钥
#+end_example
注意: 如果在 VPS 上有架设网页，请使用 webroot 模式生成证书而不是 TLS 小节中提到的 standalone 模式
**** 证书生成
#+begin_src sh 
  $ ~/.acme.sh/acme.sh --issue -d mydomain.me --webroot /path/to/webroot --keylength ec-256
#+end_src
**** 安装证书和密钥
#+begin_src sh 
  $ acme.sh --install-cert -d mydomain.com --ecc \
    --key-file       /etc/v2ray/v2ray.key \
    --fullchain-file /etc/v2ray/v2ray.crt \
    --reloadcmd     "service nginx force-reload"
#+end_src
**** Nginx 配置
#+begin_src sh 
  server {
      listen 443 ssl;
      listen [::]:443 ssl;

      ssl_certificate       /etc/v2ray/v2ray.crt;
      ssl_certificate_key   /etc/v2ray/v2ray.key;
      ssl_session_timeout 1d;
      ssl_session_cache shared:MozSSL:10m;
      ssl_session_tickets off;

      ssl_protocols         TLSv1.2 TLSv1.3;
      ssl_ciphers           ECDHE-ECDSA-AES128-GCM-SHA256:ECDHE-RSA-AES128-GCM-SHA256:ECDHE-ECDSA-AES256-GCM-SHA384:ECDHE-RSA-AES256-GCM-SHA384:ECDHE-ECDSA-CHACHA20-POLY1305:ECDHE-RSA-CHACHA20-POLY1305:DHE-RSA-AES128-GCM-SHA256:DHE-RSA-AES256-GCM-SHA384;
      ssl_prefer_server_ciphers off;

      server_name           mydomain.me;
      location /ray { # 与 V2Ray 配置中的 path 保持一致
	  if ($http_upgrade != "websocket") { # WebSocket协商失败时返回404
		 return 404;
	     }
	     proxy_redirect off;
	     proxy_pass http://127.0.0.1:10000; # 假设WebSocket监听在环回地址的10000端口上
	     proxy_http_version 1.1;
	     proxy_set_header Upgrade $http_upgrade;
	     proxy_set_header Connection "upgrade";
	     proxy_set_header Host $host;
	     # Show real IP in v2ray access.log
	     proxy_set_header X-Real-IP $remote_addr;
	     proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
      }
  }
#+end_src
