html/v2ray/transport/websocket.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Websocket</title>
<meta name="author" content="Wu, Shanliang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="tls.html"> UP </a>
 |
 <a accesskey="H" href="transport.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Websocket</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfe145d2">配置</a>
<ul>
<li><a href="#org04953f0">服务器</a></li>
<li><a href="#orgbadca9a">客户端</a></li>
</ul>
</li>
<li><a href="#org7079352">WebSocket + TLS + Web</a>
<ul>
<li><a href="#orgb08d51d">服务器</a>
<ul>
<li><a href="#org50d494b">V2ray</a></li>
<li><a href="#orgb4108b4">证书</a>
<ul>
<li><a href="#org15279b3">证书生成</a></li>
<li><a href="#org32e9481">安装证书和密钥</a></li>
<li><a href="#org89de4b2">Nginx 配置</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2d6e972">客户端</a></li>
<li><a href="#org6cc35f7">注意</a></li>
</ul>
</li>
<li><a href="#orgbe5a068">WebSocket + BrowserForwarder</a>
<ul>
<li><a href="#org66ea04c">配置</a>
<ul>
<li><a href="#orgbd83963">客户端</a></li>
<li><a href="#orgde5b02a">作为转发服务器的浏览器配置</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
WebSocket 的配置其实很简单，就跟 mKCP 一样把 network 一改就行了
</p>
<div id="outline-container-orgfe145d2" class="outline-2">
<h2 id="orgfe145d2">配置</h2>
<div class="outline-text-2" id="text-orgfe145d2">
</div>
<div id="outline-container-org04953f0" class="outline-3">
<h3 id="org04953f0">服务器</h3>
<div class="outline-text-3" id="text-org04953f0">
<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #ffa07a;">"inbounds"</span>: [
        {
            <span style="color: #ffa07a;">"port"</span>: 16823,
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"vmess"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"clients"</span>: [
                    {
                        <span style="color: #ffa07a;">"id"</span>: <span style="color: #ffa07a;">"b831381d-6324-4d53-ad4f-8cda48b30811"</span>,
                        <span style="color: #ffa07a;">"alterId"</span>: 64
                    }
                ]
            },
            <span style="color: #ffa07a;">"streamSettings"</span>: {
                <span style="color: #ffa07a;">"network"</span>:<span style="color: #ffa07a;">"ws"</span>
            }
        }
    ],
    <span style="color: #ffa07a;">"outbounds"</span>: [
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"freedom"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {}
        }
    ]
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbadca9a" class="outline-3">
<h3 id="orgbadca9a">客户端</h3>
<div class="outline-text-3" id="text-orgbadca9a">
<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #ffa07a;">"inbounds"</span>: [
        {
            <span style="color: #ffa07a;">"port"</span>: 1080,
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"socks"</span>,
            <span style="color: #ffa07a;">"sniffing"</span>: {
                <span style="color: #ffa07a;">"enabled"</span>: <span style="color: #7fffd4;">true</span>,
                <span style="color: #ffa07a;">"destOverride"</span>: [<span style="color: #ffa07a;">"http"</span>, <span style="color: #ffa07a;">"tls"</span>]
            },
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"auth"</span>: <span style="color: #ffa07a;">"noauth"</span>
            }
        }
    ],
    <span style="color: #ffa07a;">"outbounds"</span>: [
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"vmess"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"vnext"</span>: [
                    {
                        <span style="color: #ffa07a;">"address"</span>: <span style="color: #ffa07a;">"serveraddr.com"</span>,
                        <span style="color: #ffa07a;">"port"</span>: 16823,
                        <span style="color: #ffa07a;">"users"</span>: [
                            {
                                <span style="color: #ffa07a;">"id"</span>: <span style="color: #ffa07a;">"b831381d-6324-4d53-ad4f-8cda48b30811"</span>,
                                <span style="color: #ffa07a;">"alterId"</span>: 64
                            }
                        ]
                    }
                ]
            },
            <span style="color: #ffa07a;">"streamSettings"</span>:{
                <span style="color: #ffa07a;">"network"</span>:<span style="color: #ffa07a;">"ws"</span>
            }
        }
    ]
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7079352" class="outline-2">
<h2 id="org7079352">WebSocket + TLS + Web</h2>
<div class="outline-text-2" id="text-org7079352">
<p>
接下来搭配 Web 服务并同时实现 TLS 和 WebSocket
</p>
<ul class="org-ul">
<li>使用 Nginx/Caddy/Apache 是因为 VPS 已经有 Nginx/Caddy/Apache 可以将 V2Ray 稍作隐藏</li>
<li>使用 WebSocket 是因为搭配 Nginx/Caddy/Apache 只能用 WebSocket</li>
<li>使用 TLS 是因为可以流量加密，看起来更像 HTTPS</li>
</ul>

<pre class="example" id="org09be5bb">
也许 WebSocket + TLS + Web 的配置组合相对较好，但不意味着这样的配置适合任何人
</pre>

<p>
注意: V2Ray 的 Websocket + TLS 配置组合并不依赖 Nginx/Caddy/Apache，只是能与其搭配使用而已，没有它们也可以正常使用
</p>
</div>
<div id="outline-container-orgb08d51d" class="outline-3">
<h3 id="orgb08d51d">服务器</h3>
<div class="outline-text-3" id="text-orgb08d51d">
<p>
这次 TLS 的配置将写入 Web 配置中，由这些软件来监听 443 端口（443 比较常用，并非 443 不可），然后将流量转发到 V2Ray 的 WebSocket 所监听的内网端口（本例是 10000），V2Ray 服务器端不需要配置 TLS
</p>
</div>
<div id="outline-container-org50d494b" class="outline-4">
<h4 id="org50d494b">V2ray</h4>
<div class="outline-text-4" id="text-org50d494b">
<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #ffa07a;">"inbounds"</span>: [
        {
            <span style="color: #ffa07a;">"port"</span>: 10000,
            <span style="color: #ffa07a;">"listen"</span>:<span style="color: #ffa07a;">"127.0.0.1"</span>,<span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#21482;&#30417;&#21548; 127.0.0.1&#65292;&#36991;&#20813;&#38500;&#26412;&#26426;&#22806;&#30340;&#26426;&#22120;&#25506;&#27979;&#21040;&#24320;&#25918;&#20102; 10000 &#31471;&#21475;</span>
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"vmess"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"clients"</span>: [
                    {
                        <span style="color: #ffa07a;">"id"</span>: <span style="color: #ffa07a;">"b831381d-6324-4d53-ad4f-8cda48b30811"</span>,
                        <span style="color: #ffa07a;">"alterId"</span>: 0
                    }
                ]
            },
            <span style="color: #ffa07a;">"streamSettings"</span>: {
                <span style="color: #ffa07a;">"network"</span>: <span style="color: #ffa07a;">"ws"</span>,
                <span style="color: #ffa07a;">"wsSettings"</span>: {
                    <span style="color: #ffa07a;">"path"</span>: <span style="color: #ffa07a;">"/ray"</span>
                }
            }
        }
    ],
    <span style="color: #ffa07a;">"outbounds"</span>: [
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"freedom"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {}
        }
    ]
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb4108b4" class="outline-4">
<h4 id="orgb4108b4">证书</h4>
<div class="outline-text-4" id="text-orgb4108b4">
<p>
Nginx 配置和 Apache 配置中使用的是域名和证书使用 TLS 小节的举例，请替换成自己的
</p>
<pre class="example" id="org630a2e5">
因为 Caddy 会自动申请证书并自动更新，所以使用 Caddy 不用指定证书、密钥
</pre>
<p>
注意: 如果在 VPS 上有架设网页，请使用 webroot 模式生成证书而不是 TLS 小节中提到的 standalone 模式
</p>
</div>
<div id="outline-container-org15279b3" class="outline-5">
<h5 id="org15279b3">证书生成</h5>
<div class="outline-text-5" id="text-org15279b3">
<div class="org-src-container">
<pre class="src src-sh">$ ~/.acme.sh/acme.sh --issue -d mydomain.me --webroot /path/to/webroot --keylength ec-256
</pre>
</div>
</div>
</div>
<div id="outline-container-org32e9481" class="outline-5">
<h5 id="org32e9481">安装证书和密钥</h5>
<div class="outline-text-5" id="text-org32e9481">
<div class="org-src-container">
<pre class="src src-sh">$ acme.sh --install-cert -d mydomain.com --ecc <span style="color: #ffa07a;">\</span>
  --key-file       /etc/v2ray/v2ray.key <span style="color: #ffa07a;">\</span>
  --fullchain-file /etc/v2ray/v2ray.crt <span style="color: #ffa07a;">\</span>
  --reloadcmd     <span style="color: #ffa07a;">"service nginx force-reload"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org89de4b2" class="outline-5">
<h5 id="org89de4b2">Nginx 配置</h5>
<div class="outline-text-5" id="text-org89de4b2">
<div class="org-src-container">
<pre class="src src-sh">server {
    listen 443 ssl;
    listen [::]:443 ssl;

    ssl_certificate       /etc/v2ray/v2ray.crt;
    ssl_certificate_key   /etc/v2ray/v2ray.key;
    ssl_session_timeout 1d;
    ssl_session_cache shared:MozSSL:10m;
    ssl_session_tickets off;

    ssl_protocols         TLSv1.2 TLSv1.3;
    ssl_ciphers           ECDHE-ECDSA-AES128-GCM-SHA256:ECDHE-RSA-AES128-GCM-SHA256:ECDHE-ECDSA-AES256-GCM-SHA384:ECDHE-RSA-AES256-GCM-SHA384:ECDHE-ECDSA-CHACHA20-POLY1305:ECDHE-RSA-CHACHA20-POLY1305:DHE-RSA-AES128-GCM-SHA256:DHE-RSA-AES256-GCM-SHA384;
    ssl_prefer_server_ciphers off;

    server_name           mydomain.me;
    location /ray { <span style="color: #ff4500;"># </span><span style="color: #ff4500;">&#19982; V2Ray &#37197;&#32622;&#20013;&#30340; path &#20445;&#25345;&#19968;&#33268;</span>
        <span style="color: #00ffff;">if</span> ($<span style="color: #eedd82;">http_upgrade</span> != <span style="color: #ffa07a;">"websocket"</span>) { <span style="color: #ff4500;"># </span><span style="color: #ff4500;">WebSocket&#21327;&#21830;&#22833;&#36133;&#26102;&#36820;&#22238;404</span>
               <span style="color: #00ffff;">return</span> 404;
           }
           proxy_redirect off;
           proxy_pass http://127.0.0.1:10000; <span style="color: #ff4500;"># </span><span style="color: #ff4500;">&#20551;&#35774;WebSocket&#30417;&#21548;&#22312;&#29615;&#22238;&#22320;&#22336;&#30340;10000&#31471;&#21475;&#19978;</span>
           proxy_http_version 1.1;
           proxy_set_header Upgrade $<span style="color: #eedd82;">http_upgrade</span>;
           proxy_set_header Connection <span style="color: #ffa07a;">"upgrade"</span>;
           proxy_set_header Host $<span style="color: #eedd82;">host</span>;
           <span style="color: #ff4500;"># </span><span style="color: #ff4500;">Show real IP in v2ray access.log</span>
           proxy_set_header X-Real-IP $<span style="color: #eedd82;">remote_addr</span>;
           proxy_set_header X-Forwarded-For $<span style="color: #eedd82;">proxy_add_x_forwarded_for</span>;
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
