src/v2ray/transport/websocket.org
** 客户端
#+begin_src js 
  {
      "inbounds": [
	  {
	      "port": 1080,
	      "listen": "127.0.0.1",
	      "protocol": "socks",
	      "sniffing": {
		  "enabled": true,
		  "destOverride": ["http", "tls"]
	      },
	      "settings": {
		  "auth": "noauth",
		  "udp": false
	      }
	  }
      ],
      "outbounds": [
	  {
	      "protocol": "vmess",
	      "settings": {
		  "vnext": [
		      {
			  "address": "mydomain.me",
			  "port": 443,
			  "users": [
			      {
				  "id": "b831381d-6324-4d53-ad4f-8cda48b30811",
				  "alterId": 64
			      }
			  ]
		      }
		  ]
	      },
	      "streamSettings": {
		  "network": "ws",
		  "security": "tls",
		  "wsSettings": {
		      "path": "/ray"
		  }
	      }
	  }
      ]
  }
#+end_src
** 注意
+ V2Ray 自 4.18.1 后支持 TLS1.3，如果开启并强制 TLS1.3 请注意 v2ray 客户端版本
+ 较低版本的 nginx 的 location 需要写为 /ray/ 才能正常工作
+ 如果在设置完成之后不能成功使用，可能是由于 SElinux 机制(如果你是 CentOS 7 的用户请特别留意 SElinux 这一机制)阻止了 Nginx 转发向内网的数据。如果是这样的话，在 V2Ray 的日志里不会有访问信息，在 Nginx 的日志里会出现大量的 "Permission Denied" 字段，要解决这一问题需要在终端下键入以下命令：
  #+begin_src sh 
    setsebool -P httpd_can_network_connect 1
  #+end_src
+ 请保持服务器和客户端的 wsSettings 严格一致，对于 V2Ray，/ray 和 /ray/ 是不一样的
+ 较低版本的系统/浏览器可能无法完成握手. 如 Chrome 49/XP SP3, Safari 8/iOS 8.4, Safari 8/OS X 10.10 及更低的版本. 如果设备比较旧, 则可以通过在配置中添加较旧的 TLS 协议以完成握手

#+begin_example
  开启了 TLS 之后 path 参数是被加密的，GFW 看不到

  主动探测一个 path 产生 Bad request 不能证明是 V2Ray

  不安全的因素在于人，自己的问题就不要甩锅

  使用 Header 分流并不比 path 安全， 不要迷信
#+end_example
* WebSocket + BrowserForwarder
#+begin_example
通过 WebSocket 的配置，服务端可以用一个真正的 HTTP 服务器接收 V2Ray 数据
#+end_example

而 V2Ray 4.37.0 加入的 *浏览器转发* _BrowserForwarder_ 模块，则可以让真正的网页浏览器发送 V2Ray 数据。如果说 HTTP 服务器隐藏了 V2Ray 服务器，那么使用浏览器转发，浏览器隐藏了 V2Ray 客户端。示意图如下：

#+begin_example
  [V2Ray client] --> [Browser] --> {Internet} --> [HTTP server] --> [V2Ray server] --> [github.com]
#+end_example

然而，最 tricky 的地方也正与浏览器有关。由于在日常使用中，浏览器往往是连上代理之后访问网络的。但是这里，浏览器成了 V2Ray 的代理服务器：

#+begin_example
  [Browser A] --> [V2Ray client] --> [Browser B] --> {Internet} --> [HTTP server] --> [V2Ray server] --> [github.com]
#+end_example

+ Browser A 是面向用户的浏览器
+ Browser B 则仅仅用于转发 V2Ray 流量

如果不想用两个浏览器的话，就需要注意配置路由规则，确保浏览器是直连科学服务器的。以下配置假定用户使用同一个浏览器上网以及转发。
** 配置
在实际应用场景中，浏览器转发模块一般用在客户端。不需要额外对服务器进行额外配置
#+begin_example
任何使用 WebSocket 作为传输配置的客户端都可以配置为使用浏览器转发。不限于 WebSocket + TLS + Web 配置方式
#+end_example
*** 客户端
在 WebSocket + TLS + Web 客户端配置的基础上进行修改

#+begin_src js 
  {
      "inbounds": [
	  {
	      "port": 1080,
	      "protocol": "socks",
	      "sniffing": {
		  "enabled": true,
		  "destOverride": ["http", "tls"]
	      },
	      "settings": {
		  "auth": "noauth"
	      }
	  }
      ],
      "outbounds": [
	  {
	      "protocol": "vless",
	      "settings": {
		  "vnext": [
		      {
			  "address": "yourserver",
			  "port": 443,
			  "users": [
			      {
				  "id": "your-id",
				  "encryption": "none"
			      }
			  ]
		      }
		  ]
	      },
	      "streamSettings":{
		  "network": "ws",
		  "wsSettings": {
		      "path": "/yourpath",
		      "useBrowserForwarding": true
		  },
		  "security": "tls",
		  "tlsSettings": {
		      "serverName": "yourserver",
		      "allowInsecure": false
		  }
	      }
	  },
	  {
	      "protocol": "freedom",
	      "settings": {},
	      "tag": "direct"
	  }
      ],
      "routing": {
	  "rules": [
	      {
		  "type": "field",
		  "ip": ["127.0.0.1"],
		  "outboundTag": "direct"
	      },
	      {
		  "type": "field",
		  "domain": ["yourserver"],
		  "outboundTag": "direct"
	      }
	  ]
      },
      "browserForwarder": {
	  "listenAddr": "127.0.0.1",
	  "listenPort": 8080
      }
  }
#+end_src

+ _browserForwarder_ 在 _listenPort_ 所指定的端口上（本例是 8080 ）监听，稍后用于转发流量的浏览器需要访问此端口
+ ws 设置中的 _"useBrowserForwarding": true_ 指示此 WebSocket 要由浏览器转发
+ 设置了 *直连* _127.0.0.1_ 和 _科学服务器_ 的路由规则
  #+begin_example
    如果不直连 127.0.0.1， V2Ray 无法与本机浏览器进行连接，流量将会一直在 V2Ray 和你的浏览器之间兜圈子，访问任何需要走 ws 的网站都会 timeout

    如果有别的分流手段可以实现上述目的，例如使用 Privoxy ，或者使用另一个不走代理的浏览器作为转发服务器，那么可以不需要此处的分流规则
  #+end_example
+ 也可以使用 vmess 协议取代 vless 协议

为了使浏览器转发模块工作，还必须 [[https://github.com/v2fly/v2ray-core/releases][下载]] 与当前 V2Ray 相同版本的 _v2ray-extra.zip_ 。并将 _browserforwarder_ 目录其解压到资源文件路径 中。为了简单起见，直接解压到 v2ray 所在目录，类似下面的列表：

#+begin_src sh 
  .
  ├── browserforwarder
  │   ├── index.html
  │   └── index.js
  ├── v2ray.exe
  └── wv2ray.exe
#+end_src
