html/v2ray/transport/websocket.html
<div id="outline-container-org2d6e972" class="outline-3">
<h3 id="org2d6e972">客户端</h3>
<div class="outline-text-3" id="text-org2d6e972">
<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #ffa07a;">"inbounds"</span>: [
        {
            <span style="color: #ffa07a;">"port"</span>: 1080,
            <span style="color: #ffa07a;">"listen"</span>: <span style="color: #ffa07a;">"127.0.0.1"</span>,
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"socks"</span>,
            <span style="color: #ffa07a;">"sniffing"</span>: {
                <span style="color: #ffa07a;">"enabled"</span>: <span style="color: #7fffd4;">true</span>,
                <span style="color: #ffa07a;">"destOverride"</span>: [<span style="color: #ffa07a;">"http"</span>, <span style="color: #ffa07a;">"tls"</span>]
            },
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"auth"</span>: <span style="color: #ffa07a;">"noauth"</span>,
                <span style="color: #ffa07a;">"udp"</span>: <span style="color: #7fffd4;">false</span>
            }
        }
    ],
    <span style="color: #ffa07a;">"outbounds"</span>: [
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"vmess"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"vnext"</span>: [
                    {
                        <span style="color: #ffa07a;">"address"</span>: <span style="color: #ffa07a;">"mydomain.me"</span>,
                        <span style="color: #ffa07a;">"port"</span>: 443,
                        <span style="color: #ffa07a;">"users"</span>: [
                            {
                                <span style="color: #ffa07a;">"id"</span>: <span style="color: #ffa07a;">"b831381d-6324-4d53-ad4f-8cda48b30811"</span>,
                                <span style="color: #ffa07a;">"alterId"</span>: 64
                            }
                        ]
                    }
                ]
            },
            <span style="color: #ffa07a;">"streamSettings"</span>: {
                <span style="color: #ffa07a;">"network"</span>: <span style="color: #ffa07a;">"ws"</span>,
                <span style="color: #ffa07a;">"security"</span>: <span style="color: #ffa07a;">"tls"</span>,
                <span style="color: #ffa07a;">"wsSettings"</span>: {
                    <span style="color: #ffa07a;">"path"</span>: <span style="color: #ffa07a;">"/ray"</span>
                }
            }
        }
    ]
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org6cc35f7" class="outline-3">
<h3 id="org6cc35f7">注意</h3>
<div class="outline-text-3" id="text-org6cc35f7">
<ul class="org-ul">
<li>V2Ray 自 4.18.1 后支持 TLS1.3，如果开启并强制 TLS1.3 请注意 v2ray 客户端版本</li>
<li>较低版本的 nginx 的 location 需要写为 <i>ray</i> 才能正常工作</li>
<li><p>
如果在设置完成之后不能成功使用，可能是由于 SElinux 机制(如果你是 CentOS 7 的用户请特别留意 SElinux 这一机制)阻止了 Nginx 转发向内网的数据。如果是这样的话，在 V2Ray 的日志里不会有访问信息，在 Nginx 的日志里会出现大量的 "Permission Denied" 字段，要解决这一问题需要在终端下键入以下命令：
</p>
<div class="org-src-container">
<pre class="src src-sh">setsebool -P httpd_can_network_connect 1
</pre>
</div></li>
<li>请保持服务器和客户端的 wsSettings 严格一致，对于 V2Ray，/ray 和 <i>ray</i> 是不一样的</li>
<li>较低版本的系统/浏览器可能无法完成握手. 如 Chrome 49/XP SP3, Safari 8/iOS 8.4, Safari 8/OS X 10.10 及更低的版本. 如果设备比较旧, 则可以通过在配置中添加较旧的 TLS 协议以完成握手</li>
</ul>

<pre class="example" id="orgafa1dce">
开启了 TLS 之后 path 参数是被加密的，GFW 看不到

主动探测一个 path 产生 Bad request 不能证明是 V2Ray

不安全的因素在于人，自己的问题就不要甩锅

使用 Header 分流并不比 path 安全， 不要迷信
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbe5a068" class="outline-2">
<h2 id="orgbe5a068">WebSocket + BrowserForwarder</h2>
<div class="outline-text-2" id="text-orgbe5a068">
<pre class="example" id="org4f520b9">
通过 WebSocket 的配置，服务端可以用一个真正的 HTTP 服务器接收 V2Ray 数据
</pre>

<p>
而 V2Ray 4.37.0 加入的 <b>浏览器转发</b> <span class="underline">BrowserForwarder</span> 模块，则可以让真正的网页浏览器发送 V2Ray 数据。如果说 HTTP 服务器隐藏了 V2Ray 服务器，那么使用浏览器转发，浏览器隐藏了 V2Ray 客户端。示意图如下：
</p>

<pre class="example" id="org24bad66">
[V2Ray client] --&gt; [Browser] --&gt; {Internet} --&gt; [HTTP server] --&gt; [V2Ray server] --&gt; [github.com]
</pre>

<p>
然而，最 tricky 的地方也正与浏览器有关。由于在日常使用中，浏览器往往是连上代理之后访问网络的。但是这里，浏览器成了 V2Ray 的代理服务器：
</p>

<pre class="example" id="org7d998f3">
[Browser A] --&gt; [V2Ray client] --&gt; [Browser B] --&gt; {Internet} --&gt; [HTTP server] --&gt; [V2Ray server] --&gt; [github.com]
</pre>

<ul class="org-ul">
<li>Browser A 是面向用户的浏览器</li>
<li>Browser B 则仅仅用于转发 V2Ray 流量</li>
</ul>

<p>
如果不想用两个浏览器的话，就需要注意配置路由规则，确保浏览器是直连科学服务器的。以下配置假定用户使用同一个浏览器上网以及转发。
</p>
</div>
<div id="outline-container-org66ea04c" class="outline-3">
<h3 id="org66ea04c">配置</h3>
<div class="outline-text-3" id="text-org66ea04c">
<p>
在实际应用场景中，浏览器转发模块一般用在客户端。不需要额外对服务器进行额外配置
</p>
<pre class="example" id="orgcc01296">
任何使用 WebSocket 作为传输配置的客户端都可以配置为使用浏览器转发。不限于 WebSocket + TLS + Web 配置方式
</pre>
</div>
<div id="outline-container-orgbd83963" class="outline-4">
<h4 id="orgbd83963">客户端</h4>
<div class="outline-text-4" id="text-orgbd83963">
<p>
在 WebSocket + TLS + Web 客户端配置的基础上进行修改
</p>

<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #ffa07a;">"inbounds"</span>: [
        {
            <span style="color: #ffa07a;">"port"</span>: 1080,
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"socks"</span>,
            <span style="color: #ffa07a;">"sniffing"</span>: {
                <span style="color: #ffa07a;">"enabled"</span>: <span style="color: #7fffd4;">true</span>,
                <span style="color: #ffa07a;">"destOverride"</span>: [<span style="color: #ffa07a;">"http"</span>, <span style="color: #ffa07a;">"tls"</span>]
            },
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"auth"</span>: <span style="color: #ffa07a;">"noauth"</span>
            }
        }
    ],
    <span style="color: #ffa07a;">"outbounds"</span>: [
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"vless"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"vnext"</span>: [
                    {
                        <span style="color: #ffa07a;">"address"</span>: <span style="color: #ffa07a;">"yourserver"</span>,
                        <span style="color: #ffa07a;">"port"</span>: 443,
                        <span style="color: #ffa07a;">"users"</span>: [
                            {
                                <span style="color: #ffa07a;">"id"</span>: <span style="color: #ffa07a;">"your-id"</span>,
                                <span style="color: #ffa07a;">"encryption"</span>: <span style="color: #ffa07a;">"none"</span>
                            }
                        ]
                    }
                ]
            },
            <span style="color: #ffa07a;">"streamSettings"</span>:{
                <span style="color: #ffa07a;">"network"</span>: <span style="color: #ffa07a;">"ws"</span>,
                <span style="color: #ffa07a;">"wsSettings"</span>: {
                    <span style="color: #ffa07a;">"path"</span>: <span style="color: #ffa07a;">"/yourpath"</span>,
                    <span style="color: #ffa07a;">"useBrowserForwarding"</span>: <span style="color: #7fffd4;">true</span>
                },
                <span style="color: #ffa07a;">"security"</span>: <span style="color: #ffa07a;">"tls"</span>,
                <span style="color: #ffa07a;">"tlsSettings"</span>: {
                    <span style="color: #ffa07a;">"serverName"</span>: <span style="color: #ffa07a;">"yourserver"</span>,
                    <span style="color: #ffa07a;">"allowInsecure"</span>: <span style="color: #7fffd4;">false</span>
                }
            }
        },
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"freedom"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {},
            <span style="color: #ffa07a;">"tag"</span>: <span style="color: #ffa07a;">"direct"</span>
        }
    ],
    <span style="color: #ffa07a;">"routing"</span>: {
        <span style="color: #ffa07a;">"rules"</span>: [
            {
                <span style="color: #ffa07a;">"type"</span>: <span style="color: #ffa07a;">"field"</span>,
                <span style="color: #ffa07a;">"ip"</span>: [<span style="color: #ffa07a;">"127.0.0.1"</span>],
                <span style="color: #ffa07a;">"outboundTag"</span>: <span style="color: #ffa07a;">"direct"</span>
            },
            {
                <span style="color: #ffa07a;">"type"</span>: <span style="color: #ffa07a;">"field"</span>,
                <span style="color: #ffa07a;">"domain"</span>: [<span style="color: #ffa07a;">"yourserver"</span>],
                <span style="color: #ffa07a;">"outboundTag"</span>: <span style="color: #ffa07a;">"direct"</span>
            }
        ]
    },
    <span style="color: #ffa07a;">"browserForwarder"</span>: {
        <span style="color: #ffa07a;">"listenAddr"</span>: <span style="color: #ffa07a;">"127.0.0.1"</span>,
        <span style="color: #ffa07a;">"listenPort"</span>: 8080
    }
}
</pre>
</div>

<ul class="org-ul">
<li><span class="underline">browserForwarder</span> 在 <span class="underline">listenPort</span> 所指定的端口上（本例是 8080 ）监听，稍后用于转发流量的浏览器需要访问此端口</li>
<li>ws 设置中的 <span class="underline">"useBrowserForwarding": true</span> 指示此 WebSocket 要由浏览器转发</li>
<li><p>
设置了 <b>直连</b> <span class="underline">127.0.0.1</span> 和 <span class="underline">科学服务器</span> 的路由规则
</p>
<pre class="example" id="orgc67398d">
如果不直连 127.0.0.1， V2Ray 无法与本机浏览器进行连接，流量将会一直在 V2Ray 和你的浏览器之间兜圈子，访问任何需要走 ws 的网站都会 timeout

如果有别的分流手段可以实现上述目的，例如使用 Privoxy ，或者使用另一个不走代理的浏览器作为转发服务器，那么可以不需要此处的分流规则
</pre></li>
<li>也可以使用 vmess 协议取代 vless 协议</li>
</ul>

<p>
为了使浏览器转发模块工作，还必须 <a href="https://github.com/v2fly/v2ray-core/releases">下载</a> 与当前 V2Ray 相同版本的 <span class="underline">v2ray-extra.zip</span> 。并将 <span class="underline">browserforwarder</span> 目录其解压到资源文件路径 中。为了简单起见，直接解压到 v2ray 所在目录，类似下面的列表：
</p>

<div class="org-src-container">
<pre class="src src-sh">.
&#9500;&#9472;&#9472; browserforwarder
&#9474;   &#9500;&#9472;&#9472; index.html
&#9474;   &#9492;&#9472;&#9472; index.js
&#9500;&#9472;&#9472; v2ray.exe
&#9492;&#9472;&#9472; wv2ray.exe
</pre>
</div>
</div>
</div>
